{
  "de": "Antônio Ferraz",
  "para": "Anthony Hamilton",
  "age": 59,
  "profession": "Businessman in the construction materials sector (owns a well-established supply store, currently managed by trusted staff)",
  "appearance": "Light skin, 6'0\" (1.82m), slim build, neatly trimmed gray hair, discreet-framed glasses, light dress shirts always crisply ironed, fabric pants, polished leather shoes, serious posture. Keeps his appearance understated yet calculated to project respectability.",
  "personality": "Austere, disciplined, reserved in speech but socially strategic. Expresses affection through practical gestures, believes discipline shapes character. Values status and social connections, seeing them as essential to family advancement. Carefully observes people of influence and encourages relationships that could elevate the family’s standing.",
  "gestures": "Adjusts his son’s collar before important meetings, takes a deep breath before debates, organizes documents and folders with precision, holds the silver pen inherited from his father before signing anything.",
  "symbolic_object": "Organized folders and an antique silver pen — heirloom from his father, symbolizing discipline, legacy, and the ambition to maintain appearances.",
  "address": "1205 Market Street, Historic Downtown, Wilmington, NC 28401 (lives with Joshua and Meredith in a historic house chosen for its status appeal)",
  "past_address": "849 Dock Street, Historic Downtown, Wilmington, NC 28401 (1998–2005, across from Maggie’s residence)",
  "frequent_locations": [
    "Hamilton Construction Supply (business in Northside, Wilmington)",
    "Traditional cafés in Historic Downtown",
    "Cape Fear Club — to be seen among Wilmington’s elite",
    "Networking lunches at well-known local restaurants",
    "Community events where influential families gather"
  ],
  "relationships": {
    "Meredith": "Wife; active in maintaining the family’s social image, shares his ambition for upward connections",
    "Joshua": "Only son; proud of him but sees his marriage as an opportunity for family advancement",
    "Daughter (unnamed)": "Dental student in Raleigh; affectionate but distant",
    "Maggie": "Former neighbor; cordial but keeps relationship surface-level",
    "Lauren Sullivan": "Respects her family’s influence; encourages Joshua’s proximity to her",
    "Melany Campbell": "Sees her as another valuable marriage prospect for Joshua due to status and connections",
    "Brandon/Julian": "Knows them through Joshua and Sullivan Engineering"
  },
  "timeline": [
    "1966: Born in Wilmington",
    "1983 (17): Starts working in his father’s construction supply business",
    "1989 (23): Marries Meredith",
    "1993 (27): Joshua born",
    "1997 (31): Daughter born",
    "1998–2005 (32–39): Lives in Historic Downtown, across from Maggie",
    "2006 (40): Buys Market Street house for its social prestige",
    "2011 (45): Supports Joshua’s engineering studies, instilling discipline and encouraging advantageous connections",
    "2018 (52): Joshua graduates; Anthony begins reducing involvement in the business",
    "2019 (53): Transfers business management to trusted staff",
    "2023 (58): Notes Joshua’s growing closeness to Maggie and Lauren Sullivan",
    "2024 (59): Subtly pushes Joshua toward potential matches like Lauren and later Melany Campbell for a socially advantageous marriage"
  ]
}
