{
  "de": "Clara Mendes",
  "para": "Olivia Mendes",
  "age": 23,
  "profession": "Kindergarten Teacher at Forest Hills Elementary (602 Colonial Dr, Wilmington, NC 28403)",
  "appearance": "Light skin with a sprinkle of freckles across the cheeks, 5'4\" (1.62m), curvy, long wavy red hair, bright blue eyes, myopic behind simple Medicaid glasses, wide genuine smile with one slightly crooked tooth, budget-friendly clothes (Walmart polyester blouses, tight Ross jeans, Payless sneakers), always neat: threaded brows, gel-polished nails (chipping by week's end), hair well-kept and shiny",
  "personality": "Authentic, warm, resilient; chooses happiness daily as survival, empathetic, transforms trauma into strength, street-smart but soft-hearted",
  "gestures": "Gestures animatedly, adjusts glasses constantly, laughs loud and hearty, clutches notebook tightly, crosses arms and leans in when standing her ground",
  "symbolic_object": "Notebook for daily 'happy moments' (12 filled since age 11), hiding coded 'dark days' of past trauma",
  "address": "Inherited small bungalow at 1010 N 6th St, Wilmington, NC 28401 (Northside), cozy with thrift-shop decor, family photos, and potted plants",
  "frequent_locations": [
    "Forest Hills Elementary",
    "Riverfront Farmers Market",
    "Miss Linda's soul food truck",
    "Cape Fear Riverwalk (for reflection)",
    "Halifax Community Center (for events)",
    "Wave Transit Bus"
  ],
  "relationships": {
    "Brandon": "Civil engineer met during Creekwood post-hurricane revitalization project; evolves from conflict to mutual redemption",
    "Students": "Her daily inspiration; each smile is a victory against a harsh world",
    "Neighbors": "Tight-knit Northside community, porch talks, mutual support like borrowing sugar or sharing storm prep tips"
  },
  "timeline": [
    "2002: Born in Wilmington, NC, to a struggling single mom",
    "2008 (6): Abandoned at grandma’s with a note ('Can't do this. Sorry.'), grandma fights CPS for custody",
    "2010 (8): Caught shoplifting food (bread, milk) from Food Lion due to hunger; sent to Stonewall Jackson Youth Development Center for 1 year",
    "2011 (9): Starts notebook of 'happy moments' as emotional survival, learning resilience from center's counselor",
    "2013 (11): Leaves juvie, helps grandma raise three younger brothers in Northside",
    "2014–2020 (12–18): Works as nanny, earns GED at night, faces losses: one brother killed in gang violence (Northside turf war), another jailed for robbery, third moves to Charlotte after marriage",
    "2020 (18): Arrested for possession of drugs/weapons (framed or naive mistake), acquitted with help from UNCW professors and pro bono lawyer",
    "2021–2025 (19–23): Graduates community college, becomes teacher at Forest Hills, stays rooted in Northside, joins community garden and post-hurricane rebuild efforts"
  ],
  "key_quotes": [
    "I'm not the prettiest, but I'm the happiest I know. That’s my kind of beautiful.",
    "I went hungry, got a juvie record, but I woke up today choosing gratitude. Life’s too hard to add to the pain.",
    "Brandon, you spent so long building armor you forgot how beautiful it is to be real.",
    "Two stints in juvie. One for hunger, one for being naive. What’s your story, Brandon?",
    "I came up in Northside, where every smile’s a fight won."
  ],
  "dramatic_scenes": [
    {
      "scene": "First Clash",
      "description": "Brandon, overseeing a post-hurricane rebuild in Creekwood, faces Olivia at 7:15 AM outside Forest Hills Elementary. She storms out: 'Yo, construction guy! You starting that noise now? My kids got class!' Brandon, flustered: 'Ma’am, it’s business hours...' Olivia: 'Ma’am’s your mama! I’m Teacher Olivia, and these kids deserve better!'"
    },
    {
      "scene": "Notebook Revealed",
      "description": "After a tough day, Brandon catches Olivia writing in her notebook by the Cape Fear Riverwalk. He asks what it is. She says: 'Happy moments. Today was rough, but a kid said she wants to be like me. That’s enough.' Brandon: 'Every day?' Olivia: 'Since I was 11. Some days, it’s all I got.'"
    },
    {
      "scene": "Her Home",
      "description": "Brandon visits Olivia’s Northside bungalow to discuss project changes. He’s struck by the cozy thrift-shop decor, plants, and old photos. She offers sweet tea and cornbread. He realizes happiness isn’t about money, especially in a neighborhood rebuilding from storms."
    },
    {
      "scene": "Mirror Moment",
      "description": "Brandon snaps at a community meeting: 'I can’t be like you, Olivia! I gotta be perfect!' She replies: 'You think I was born happy? I chose it, every damn day, after hunger, juvie, and losing my brothers. You can choose too.'"
    },
    {
      "scene": "Surrender",
      "description": "Brandon shows up at Forest Hills, no gel in his hair, in a plain tee, carrying paint for a school mural. Olivia grins: 'Now you’re lookin’ real good, Brandon.'"
    }
  ],
  "cinematic_description": {
    "height": "5'4\" (1.62m)",
    "body": "Curvy, natural – no gym, just genetics and daily hustle",
    "skin": "Light with freckles across cheeks and nose, reddens in sun",
    "hair": "Long, wavy red hair, well-kept and shiny",
    "eyes": "Bright blue, myopic, behind thick Medicaid glasses",
    "smile": "Wide, genuine, one slightly crooked tooth she finds charming",
    "style": "Budget but neat – thrift-shop blouses, tight jeans, generic sneakers",
    "mannerisms": "Loud talker, big gestures, hearty laugh, no social filters"
  },
  "symbolism": "Olivia embodies beauty that’s not Instagram-perfect, strength that’s not tough, happiness that’s earned, love that heals without fixing, and authenticity that disarms facades. For Brandon, she’s the mirror of who he can be, proof that wounds become strength, and the woman who loves him for him, not his status – a redemption story rooted in Wilmington’s resilience."
}
