{
  "de": "Mercedes Ferraz",
  "para": "Meredith Hamilton",
  "age": 55,
  "profession": "Homemaker, fully dedicated to her family",
  "appearance": "Fair-skinned woman, 5'4\" (1.63m), medium build. Honey-blonde wavy hair (dyed from light brown), usually tied in a low bun or loose ponytail. Light brown eyes, round face, warm expression. Prefers floral dresses, comfortable flats, and discreet pearl or gold earrings. Always carries the soft scent of lavender.",
  "personality": "Traditional, caring, and attentive, yet intrusive. Anxious to please, gives advice without being asked, and insists on knowing every detail of her husband’s and son’s lives. Proud of Joshua and likes to influence (and sometimes control) his decisions. Keeps a close friendship with Isabella, but harbors subtle jealousy toward both Anthony and Joshua.",
  "gestures": "Smooths the sleeves of others’ clothes, holds Joshua’s arm while speaking, adjusts cushions as she gives advice, sighs deeply when contradicted.",
  "symbolic_object": "A gold locket inherited from her mother, worn daily as a symbol of family protection.",
  "address": "Lives with Anthony and Joshua in a historic home at 1205 Market Street, Historic Downtown, Wilmington, NC 28401.",
  "past_address": "849 Dock Street, Historic Downtown, Wilmington, NC 28401 (1998–2005, across from Maggie and Ethan Bennett).",
  "frequent_locations": [
    "Local church",
    "Isabella Sullivan’s house",
    "Family gatherings",
    "Cafés in Historic Downtown",
    "Trips to Raleigh to visit her daughter"
  ],
  "relationships": {
    "Anthony": "Husband; emotionally dependent, subtle jealousy of his attention to others",
    "Joshua": "Eldest child; proud yet controlling",
    "Karol": "Younger daughter, studying Dentistry in Raleigh; frequent video calls and occasional visits",
    "Maggie": "Respects but judges; sees her as a threat to influence over Joshua",
    "Isabella": "Close friend and confidante, shares insecurities with her"
  },
  "timeline": [
    "1970: Born in Wilmington",
    "1988 (18): Meets Anthony; begins relationship",
    "1989 (19): Marries Anthony",
    "1993 (23): Joshua born",
    "1997 (27): Karol born",
    "1998–2005 (28–35): Lives in Historic Downtown, across from Maggie",
    "2006 (36): Moves to Market Street historic home",
    "2015 (45): Begins to feel 'empty nest' as children become independent",
    "2020 (50): Karol moves to Raleigh for Dentistry",
    "2023 (54): Deepens friendship with Isabella; notices Joshua’s involvement with Maggie"
  ]
}
