{
  "de": "Nina Leles",
  "para": "Heather Whitmore",
  "age": 38,
  "profession": "Senior Executive Assistant at Sullivan Engineering; freelances as personal organizer and assistant for select clients",
  "appearance": "5'6\" (1.68m), medium build, light brown skin with faint freckles, straightened dark brown hair usually in a low bun, expressive brown eyes, neutral tailored clothing (trousers, crisp blouses), low elegant shoes, simple jewelry, impeccable posture, direct gaze",
  "personality": "Elegant without ostentation; firm, ironic, highly observant. Zero tolerance for prejudice. Master of organization, finance tracking, and project software. Silently envious of wealthy women like Lauren or high-profile clients, but channels it into professional excellence. Loyal to those she respects, the first to say 'no' when necessary.",
  "gestures": "Always holding a tablet; cleans glasses while thinking; straightens stacks and objects as she walks; sketches clothing ideas in a fashion notebook; measures spaces by sight before organizing",
  "symbolic_object": "Grandmother’s sewing machine and fashion sketchbook — symbols of her lifelong dream to study fashion and launch her own brand",
  "address": "Well-kept older apartment on Carolina Beach Avenue N, Wilmington, NC — purchased with extra income from freelance organizing",
  "frequent_locations": [
    "Sullivan Engineering (1122 S 3rd St)",
    "fabric and craft stores",
    "her son Davi’s school",
    "Davi’s rowing/swimming club",
    "live music bars with Joann and Gavin"
  ],
  "relationships": {
    "Davi": "Son, 13 — her entire world; well-liked in the office. Attends private school funded partly by the firm.",
    "Dr. Raymond Sullivan": "Trusts her completely; sees her as the strategic filter and backbone of operations",
    "Gavin": "Mutual respect; she shields him from overload, he’s her steady ally",
    "Brandon": "Tense respect; she’s one of the few who speaks hard truths to him",
    "Lauren": "Friction — rejects her arrogance, but remains professional",
    "Maggie and Joann": "Inner circle; share drinks and live music nights"
  },
  "timeline": [
    "1987: Born in Wilmington; grows up watching her grandmother work in local textile workshops (turning fabric scraps into market goods)",
    "2003–2006 (16–19): Dreams of studying fashion; learns sewing and design basics from grandmother",
    "2010 (23): Joins Sullivan Engineering as receptionist; quickly recognized for organizational skill",
    "2011 (24): Pregnant with Davi; relationship ends, father provides only legal child support",
    "2012 (25): Davi born",
    "2013–2015 (26–28): Promoted to senior executive assistant; takes over operations finance and executive scheduling",
    "2016–2020 (29–33): Completes courses in personal organization and project software; begins freelance work as personal assistant/organizer for select clients",
    "2021 (34): Purchases her own apartment with combined salary and freelance earnings",
    "2023 (36): Brandon sponsors Davi at the local rowing/swimming club; Sullivan Engineering covers his school tuition",
    "2025 (38): Both respected and feared at the office; saving for Davi’s future while keeping her fashion dream alive"
  ]
}
