{
  "de": "Vera Lúcia Fontes",
  "para": "Isabella Romano Sullivan",
  "age": 61,
  "origin": "Daughter of Italian immigrants from Florence; heritage rooted in post-war migration",
  "profession": "Artisan and entrepreneur; founder of Luce Fiorentina — luxury handcrafted candles and décor for high-end events",
  "appearance": "5'5\" (1.65m), blonde (dyed to maintain tone and discreetly cover hair loss from trichotillomania), green eyes, clear fair skin, impeccable posture. Dresses in classic Italian-inspired clothing made of fine fabrics, often linen and silk; light, refined makeup; wears a signature lavender-jasmine perfume created for her brand. Hands show faint signs of wax work from candle-making.",
  "personality": "Gentle, observant, refined, yet carries a deep, quiet loneliness from living far from her family in Italy. Tells harmless white lies or embellishes stories to feel relevant and interesting in social circles. Finds her true joy and calm in her studio or during annual trips to Florence. Avoids conflict, cherishes beauty and order as anchors for her emotional stability.",
  "gestures": "Touches fabrics before sewing, inhales candle aromas deeply before packaging, adjusts table arrangements or displays even when unnecessary, clasps hands lightly when speaking to strangers, occasionally twirls a strand of hair when anxious.",
  "symbolic_object": "Her Luce Fiorentina studio — a refuge that embodies her identity, artistic passion, and connection to her Italian heritage.",
  "address": "1847 Lumina Avenue, Wrightsville Beach, NC 28480 — oceanfront home shared with family, with a private candle studio overlooking the garden.",
  "studio_address": "Rented boutique space near Wrightsville Beach, decorated in Southern-coastal style with a sewing bench, candle displays, and a small section for imported Italian décor.",
  "frequent_locations": [
    "Luce Fiorentina studio",
    "High-end décor boutiques in Historic Downtown Wilmington",
    "Cape Fear Country Club seasonal charity markets",
    "Wilmington Art and Design Festival",
    "Authentic Italian restaurants in Wilmington",
    "Annual trips to Florence, Italy"
  ],
  "relationships": {
    "Dr. Raymond": "Stable but emotionally distant marriage; he respects her as a partner but dismisses her brand as a 'hobby'",
    "Lauren": "Daughter; strained relationship due to Lauren’s embarrassment over her social embellishments",
    "Julian": "Deep emotional bond; he supports her unconditionally and often assists in her studio",
    "Francesca Romano": "Younger sister in Florence; daily confidante and unwavering supporter of Luce Fiorentina"
  },
  "timeline": [
    "1964: Born in Wilmington, NC, to Italian immigrant parents from Florence",
    "1983 (19): Meets Raymond at a social event",
    "1988 (24): Marries Raymond",
    "1991 (27): Lauren born",
    "1998 (34): Julian born",
    "2004 (40): Discovers passion for artisanal candle-making and high-end event décor",
    "2010 (46): Launches Luce Fiorentina with the tagline 'Light the Glow of Florence', initially supplying custom candles for luxury events",
    "2013 (49): Products begin selling in high-end coastal home décor stores",
    "2018 (54): Establishes presence at luxury events and design exhibitions in North Carolina",
    "Ongoing: Annual trips to Florence; dreams of opening a flagship Luce Fiorentina store in Wilmington, combining showroom and workshop"
  ]
}
